<!DOCTYPE html>
<html><head>
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
  <title>UC interview preparation</title>
  <script src="1_files/jquery.js" type="text/javascript"></script>
  <link href="1_files/resume.css" type="text/css" rel="stylesheet">
  <script type="text/javascript">
    $(document).ready(function() {
      $('#content').load('preparation.html'); 
    });
  </script>
</head>
<body onload="load()">
  <div id="content"><h1>UC interview preparation</h1>

<h2>Part1</h2>

<h3>Q1:&#20808;&#33258;&#25105;&#20171;&#32461;&#20960;&#20998;&#38047;&#65311;</h3>

<h3>Q2:&#20808;&#33258;&#25105;&#20171;&#32461;3&#20998;&#38047;&#65311;</h3>

<p>&#38754;&#35797;&#23448;&#22909;&#65281;&#25105;&#21483;&#40644;&#24605;&#19996;&#65292;&#26159;&#20013;&#23665;&#22823;&#23398;&#36719;&#20214;&#23398;&#38498;&#19977;&#24180;&#32423;&#30340;&#19968;&#21517;&#26412;&#31185;&#29983;&#12290;<br>
&#25105;&#24615;&#26684;<em>&#24320;&#26391;</em>&#65292;<em>&#27963;&#27900;</em>&#12290;&#25105;&#20570;&#20107;<em>&#35748;&#30495;</em>&#65292;<em>&#20180;&#32454;</em>&#12290;<br>
&#25105;&#21916;&#29233;<em>&#32534;&#31243;</em>&#65292;&#22240;&#20026;&#32534;&#31243;&#33021;&#22815;&#32473;&#25105;&#24102;&#26469;&#20048;&#36259;&#12290;&#25105;&#26159;&#20010;&#33258;&#20449;&#30340;&#20154;&#65292;&#22240;&#20026;&#25105;&#30456;&#20449;&#21482;&#35201;&#20570;&#20102;&#20805;&#36275;&#30340;&#20934;&#22791;&#65292;&#23601;&#33021;&#22815;&#33719;&#24471;&#25104;&#21151;&#30340;&#26426;&#20250;&#12290;&#25105;&#23815;&#23578;<em>&#20114;&#32852;&#32593;</em>&#65292;&#22240;&#20026;&#25105;&#21916;&#27426;&#20132;&#27969;&#65292;&#25105;&#25317;&#26377;&#33391;&#22909;&#30340;&#27807;&#36890;&#33021;&#21147;&#12290;&#25105;&#23815;&#23578;<em>&#24320;&#28304;</em>&#65292;&#22240;&#27492;&#25105;&#24615;&#26684;&#24320;&#26391;&#65292;&#25105;&#24895;&#24847;&#19982;&#21035;&#20154;&#20998;&#20139;&#25105;&#30340;&#25104;&#21151;&#65292;&#24895;&#24847;&#21442;&#19982;&#22242;&#38431;&#24320;&#21457;&#12290;&#25105;&#38754;&#35797;&#30340;&#32844;&#20301;&#26159;<em>javascript/html&#36719;&#20214;&#24037;&#31243;&#24072;</em>&#12290;</p>

<h3>Q3:&#37027;&#20320;&#30340;&#20248;&#21183;&#22312;&#21738;&#37324;&#65311;</h3>

<p>&#25105;&#35273;&#24471;&#25105;&#30340;&#20248;&#21183;&#22312;&#20110;&#25105;&#30340;<em>&#22362;&#25345;&#19981;&#25032;</em>&#21644;&#24555;&#36895;&#30340;<em>&#23398;&#20064;&#33021;&#21147;</em>&#65292;<em>&#35299;&#20915;&#38382;&#39064;&#33021;&#21147;</em>&#12290;<br>
&#65288;&#33021;&#21542;&#20855;&#20307;&#30340;&#35762;&#19968;&#19979;&#65311;&#65289;<br>
&#25105;&#35748;&#20026;&#30340;&#24555;&#36895;&#23398;&#20064;&#33021;&#21147;&#65292;&#35299;&#20915;&#38382;&#39064;&#33021;&#21147;&#26159;&#36825;&#26679;&#30340;&#65306;&#25105;&#20204;&#38754;&#23545;&#19968;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#33021;&#22815;&#36890;&#36807;&#20998;&#26512;&#65292;&#36890;&#36807;&#32593;&#32476;&#25628;&#32034;&#23558;&#36825;&#20010;&#38382;&#39064;&#21010;&#20998;&#25104;&#22810;&#20010;&#23567;&#38382;&#39064;&#22810;&#20010;&#23618;&#27425;&#65292;&#28982;&#21518;&#26681;&#25454;&#21508;&#20010;&#37096;&#20998;&#25105;&#20204;&#24555;&#36895;&#23398;&#20250;&#35299;&#20915;&#36825;&#20010;&#23567;&#38382;&#39064;&#30340;&#30693;&#35782;&#21644;&#26041;&#27861;&#65292;&#28982;&#21518;&#23558;&#35299;&#20915;&#20102;&#30340;&#23567;&#38382;&#39064;&#32452;&#32455;&#36215;&#26469;&#23601;&#26159;&#23545;&#25105;&#20204;&#38382;&#39064;&#30340;&#26368;&#32456;&#35299;&#20915;&#26041;&#26696;&#12290;<br>
&#27604;&#22914;&#65292;&#25105;&#20030;&#19968;&#20010;&#26368;&#36817;&#25105;&#36935;&#21040;&#30340;&#38382;&#39064;&#65306;&#21069;&#27573;&#26102;&#38388;&#25105;&#20204;&#23567;&#32452;&#25171;&#31639;&#23454;&#29616;&#20999;&#27700;&#26524;&#30340;&#32593;&#39029;&#29256;&#12290;&#25105;&#20204;&#30896;&#21040;&#30340;&#38382;&#39064;&#20415;&#26159;&#65306;&#24590;&#20040;&#23454;&#29616;&#65311;<br>
&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#26041;&#27861;&#20415;&#26159;&#21010;&#20998;&#65292;&#36890;&#36807;&#35752;&#35770;&#21644;&#25628;&#32034;&#65292;&#25105;&#20204;&#23558;&#38382;&#39064;&#21010;&#20998;&#20026;&#65306;<br>
1,&#22914;&#20309;&#23454;&#29616;&#39044;&#21152;&#36733;&#65292;&#22240;&#20026;&#28216;&#25103;&#21644;&#32593;&#39029;&#19981;&#21516;&#65292;&#28216;&#25103;&#24517;&#39035;&#35201;&#31561;&#20803;&#32032;&#21152;&#36733;&#23436;&#27605;&#25165;&#33021;&#22815;&#24320;&#22987;&#36816;&#34892;&#65292;&#32780;&#19988;&#30001;&#20110;&#21152;&#36733;&#38656;&#35201;&#19968;&#23450;&#30340;&#26102;&#38388;&#65292;&#25105;&#20204;&#38656;&#35201;&#20570;&#19968;&#20123;&#36733;&#20837;&#36895;&#24230;&#30340;&#25552;&#37266;&#25165;&#19981;&#20250;&#35753;&#29992;&#25143;&#20197;&#20026;&#27809;&#26377;&#21709;&#24212;&#12290;<br> 
2,&#22914;&#20309;&#35299;&#20915;&#28216;&#25103;&#30340;&#30028;&#38754;&#65292;&#36825;&#20010;&#38382;&#39064;&#25105;&#20204;&#20998;&#20026;&#20004;&#37096;&#20998;&#65292;&#38745;&#24577;&#30340;&#21644;&#21160;&#24577;&#30340;&#65292;&#38745;&#24577;&#30340;&#20026;2D&#65292;&#20351;&#29992;canvas2D&#23601;&#33021;&#22815;&#23436;&#25104;&#20219;&#21153;&#65292;&#21160;&#24577;&#30340;&#24517;&#39035;&#20351;&#29992;3D&#65292;&#35299;&#20915;&#30340;&#26041;&#26696;&#26159;webgl&#12290;<br> 
3,&#22914;&#20309;&#35299;&#20915;&#22768;&#38899;&#38382;&#39064;&#65292;&#36825;&#20010;&#25105;&#20204;&#37319;&#29992;Audio&#26469;&#35299;&#20915;&#12290;<br>
4,&#22914;&#20309;&#35299;&#20915;&#28216;&#25103;&#20013;&#30340;&#21028;&#23450;&#65292;&#23089;&#20048;&#24615;&#38382;&#39064;&#65292;&#36825;&#20010;&#38382;&#39064;&#24212;&#35813;&#26159;&#26368;&#26377;&#38590;&#24230;&#30340;&#19968;&#20010;&#38382;&#39064;&#65292;&#21487;&#20197;&#21010;&#20998;&#20026;&#22810;&#20010;&#23567;&#39064;&#65292;&#27604;&#22914;&#22914;&#20309;&#21028;&#26029;&#24590;&#20040;&#26679;&#25165;&#31639;&#26159;&#19968;&#20992;&#65292;&#22914;&#20309;&#38543;&#26426;&#25165;&#33021;&#23558;&#28216;&#25103;&#38590;&#24230;&#31526;&#21512;&#28176;&#36827;&#21407;&#21017;&#31561;&#38382;&#39064;&#12290;<br>
&#25152;&#20197;&#36825;&#26159;&#25105;&#23398;&#20250;&#24555;&#36895;&#35299;&#20915;&#38382;&#39064;&#30340;&#26041;&#27861;&#12290;</p>

<h3>Q4:&#37027;&#20320;&#26377;&#25104;&#23601;&#24863;&#30340;&#39033;&#30446;&#65311;</h3>

<p>&#25105;&#26368;&#26377;&#25104;&#23601;&#24863;&#30340;&#39033;&#30446;&#26159;&#25105;&#20204;&#23567;&#32452;&#20960;&#20010;&#20154;&#20570;&#30340;&#19968;&#20010;&#31532;&#19977;&#26041;&#25945;&#21153;&#31995;&#32479;&#12290;&#20570;&#36825;&#20010;&#39033;&#30446;&#30340;&#21160;&#22240;&#26159;&#22240;&#20026;&#25105;&#20204;&#23398;&#26657;&#25945;&#21153;&#31995;&#32479;&#32593;&#31449;&#21482;&#26377;IE&#20869;&#26680;&#30340;&#27983;&#35272;&#22120;&#25165;&#33021;&#35775;&#38382;&#12290;&#36825;&#23545;&#20110;&#25105;
&#20204;&#24456;&#22810;&#19981;&#20351;&#29992;IE&#20869;&#26680;&#27983;&#35272;&#22120;&#25110;&#32773;&#20351;&#29992;linux&#31995;&#32479;&#30340;&#21516;&#23398;&#36896;&#25104;&#20102;&#24456;&#22810;&#30340;&#19981;&#20415;&#12290;&#25152;&#20197;&#65292;&#25105;&#20204;&#23567;&#32452;&#20915;&#23450;&#22312;&#23454;&#39564;&#23460;&#30340;&#26381;&#21153;&#22120;&#25645;&#24314;&#19968;&#20010;&#31532;&#19977;&#26041;&#25945;&#21153;&#31995;&#32479;&#65292;&#24110;&#21161;&#35299;&#20915;&#36825;&#19968;&#38382;
&#39064;&#65292;&#25552;&#20379;&#36866;&#21512;&#21508;&#31181;&#27983;&#35272;&#22120;&#30340;&#35775;&#38382;&#30340;&#36884;&#24452;&#12290;<br>
&#36825;&#20010;&#39033;&#30446;&#26082;&#35299;&#20915;&#20102;&#25105;&#20204;&#30340;&#38382;&#39064;&#65292;&#20063;&#24110;&#21161;&#20102;&#24456;&#22810;&#30340;&#20854;&#20182;&#21516;&#23398;&#12290;&#25152;&#20197;&#36825;&#26159;&#25105;&#26368;&#26377;&#25104;&#23601;&#24863;&#30340;&#39033;&#30446;&#12290;<br>
&#39033;&#30446;&#32454;&#33410;&#65306;&#36890;&#36807;wireshark&#20998;&#26512;&#20986;&#25945;&#21153;&#31995;&#32479;&#32593;&#31449;&#20132;&#20114;&#25253;&#25991;&#21327;&#35758;&#65292;&#28982;&#21518;&#36890;&#36807;python&#27169;&#25311;&#23454;&#29616;&#19982;&#25945;&#21153;&#31995;&#32479;&#32593;&#31449;&#30340;&#20132;&#20114;&#65292;&#24314;&#31435;&#27169;&#26495;&#23558;&#20132;&#20114;&#30340;&#25253;&#25991;&#32467;&#26524;&#26174;&#31034;&#20986;
&#26469;&#12290;&#36890;&#36807;python&#30340;flask&#26694;&#26550;&#22312;&#23454;&#39564;&#23460;&#30340;&#26381;&#21153;&#22120;&#25645;&#24314;&#36215;&#32593;&#31449;&#12290;&#36890;&#36807;&#35760;&#24405;cookie&#26469;&#23454;&#29616;&#19982;&#25945;&#21153;&#31995;&#32479;&#21644;&#29992;&#25143;&#20043;&#38388;&#30340;&#20250;&#35805;&#12290;&#25105;&#20027;&#35201;&#36127;&#36131;&#20102;&#25253;&#25991;&#21327;&#35758;&#30340;&#20998;
&#26512;&#65292;&#21644;&#29992;python&#23454;&#29616;&#20110;&#25945;&#21153;&#31995;&#32479;&#30340;&#20132;&#20114;&#21151;&#33021;&#12290;</p>

<h3>Q5:&#20320;&#23545;UC&#20135;&#21697;&#30340;&#20102;&#35299;&#65311;</h3>

<p>&#25105;&#20102;&#35299;&#30340;&#24182;&#19981;&#22810;&#12290;&#25105;&#29992;&#36807;UC&#25163;&#26426;&#27983;&#35272;&#22120;&#65292;UC&#24433;&#38899;&#65292;&#20854;&#20182;&#20135;&#21697;&#26368;&#36817;&#26377;&#22312;&#23448;&#32593;&#36827;&#34892;&#20102;&#35299;&#12290;&#34429;&#28982;&#25105;&#23545;UC&#20135;&#21697;&#20102;&#35299;&#30340;&#19981;&#22810;&#65292;&#20294;&#25105;&#21487;&#20197;&#35828;&#19979;&#25105;&#23545;UC&#20844;&#21496;&#25991;&#21270;&#30340;&#24863;&#21463;&#21527;&#65311;<br>
&#22312;&#20102;&#35299;&#20102;UC&#20844;&#21496;&#30340;&#8220;&#22823;&#20116;&#8221;&#25991;&#21270;&#20043;&#21518;&#65292;&#25105;&#38750;&#24120;&#30340;&#24515;&#21160;&#12290;&#25105;&#35273;&#24471;&#22823;&#23398;&#26102;&#20195;&#36825;&#31181;&#21333;&#32431;&#30340;&#21516;&#23398;&#20851;&#31995;&#65292;&#21644;&#19968;&#36215;&#25340;&#25615;&#30340;&#27675;&#22260;&#24456;&#35753;&#20154;&#20139;&#21463;&#65292;&#35753;&#20154;&#27599;&#22825;&#37117;&#20805;&#28385;&#27963;&#21147;&#65292;&#20250;&#35753;&#20154;&#26377;&#19968;&#31181;&#24378;&#28872;&#30340;&#24402;&#23646;&#24863;&#12290;<br>
&#8220;&#24535;&#21516;&#36947;&#21644;&#65292;&#20998;&#20139;&#25104;&#21151;&#8221;&#65292;&#25105;&#23815;&#23578;&#24320;&#28304;&#65292;&#22240;&#20026;&#25105;&#35273;&#24471;&#24320;&#28304;&#26159;&#19968;&#31181;&#20998;&#20139;&#25104;&#21151;&#65292;&#32473;&#21035;&#20154;&#19968;&#36215;&#21512;&#20316;&#30340;&#19968;&#31181;&#36884;&#24452;&#65292;&#22240;&#32780;&#35768;&#22810;&#24320;&#28304;&#36719;&#20214;&#33021;&#33719;&#24471;&#25104;&#21151;&#12290;&#25105;&#24895;&#24847;&#34701;&#20837;UC&#36825;&#20010;&#38598;&#20307;&#65292;&#21516;&#20320;&#20204;&#32937;&#24182;&#32937;&#65292;&#19968;&#36215;&#20998;&#20139;&#25104;&#21151;&#12290;</p>

<h3>Q6:&#20320;&#30340;&#32844;&#19994;&#35268;&#21010;&#26159;&#20160;&#20040;&#65311;</h3>

<p>&#30446;&#21069;&#25105;&#30340;&#32844;&#19994;&#35268;&#21010;&#26159;&#36825;&#26679;&#30340;:<br>
&#31532;&#19968;&#27493;&#26159;&#22312;&#22823;&#19977;&#30830;&#23450;&#20102;&#20197;&#21518;&#30340;&#21457;&#23637;&#26041;&#21521;&#65292;&#29616;&#22312;&#25105;&#22522;&#26412;&#30830;&#23450;&#30340;&#26159;web&#24320;&#21457;&#65292;&#22240;&#20026;&#25105;&#21916;&#27426;&#20114;&#32852;&#32593;&#12290;<br>
&#31532;&#20108;&#27493;&#26159;&#22312;&#22823;&#19977;&#26257;&#26399;&#21644;&#22823;&#22235;&#26399;&#38388;&#36890;&#36807;&#23454;&#20064;&#19981;&#26029;&#22320;&#31215;&#32047;&#33258;&#24049;&#30340;&#30693;&#35782;&#65292;&#25552;&#39640;&#33258;&#24049;&#30340;&#33021;&#21147;&#12290;<br>
&#31532;&#19977;&#27493;&#26159;&#22312;&#27491;&#24335;&#27493;&#20837;&#31038;&#20250;&#30340;&#20004;&#24180;&#37324;&#65292;&#25105;&#33021;&#22815;&#36890;&#36807;&#30340;&#21162;&#21147;&#21644;&#25105;&#30340;&#28909;&#24773;&#25512;&#21160;&#21608;&#22260;&#30340;&#21457;&#23637;&#65292;&#33719;&#24471;&#21516;&#20107;&#21644;&#39046;&#23548;&#30340;&#35748;&#21487;&#65292;&#36827;&#20837;&#21021;&#32423;&#31649;&#29702;&#23618;&#21644;&#19968;&#20010;&#23567;&#22242;&#38431;&#39046;&#23548;&#32773;&#30340;&#35282;&#33394;&#12290;<br>
&#31532;&#22235;&#27493;&#26159;&#24102;&#39046;&#22242;&#38431;&#23454;&#29616;&#25105;&#30340;&#24819;&#27861;&#65292;&#24320;&#21457;&#20986;&#19968;&#20123;&#33021;&#22815;&#20026;&#20844;&#21496;&#24102;&#26469;&#36136;&#30340;&#39134;&#36291;&#30340;&#20135;&#21697;&#65292;&#25512;&#21160;&#20844;&#21496;&#24448;&#21069;&#21457;&#23637;&#65292;&#25171;&#36896;&#19968;&#21482;&#20986;&#33394;&#30340;&#22242;&#38431;&#12290;<br>
&#30446;&#21069;&#25105;&#30340;&#35268;&#21010;&#24046;&#19981;&#22810;&#23601;&#26159;&#36825;&#26679;&#12290;</p>

<h3>Q7:&#20320;&#23545;&#20320;&#24212;&#32856;&#30340;&#32844;&#20301;&#20102;&#35299;&#21527;&#65311;</h3>

<p>&#24681;&#65292;&#25105;&#26377;&#19968;&#23450;&#30340;&#20102;&#35299;&#12290;javascript/html&#36719;&#20214;&#24037;&#31243;&#24072;&#24212;&#35813;&#36127;&#36131;&#20844;&#21496;&#30340;web&#21069;&#21488;&#24320;&#21457;&#65292;&#21253;&#25324;&#20844;&#21496;&#32593;&#31449;&#30340;&#32500;&#25252;&#65292;&#20844;&#21496;&#21069;&#31471;&#20135;&#21697;&#30340;&#24320;&#21457;&#65292;&#29992;&#25143;&#30340;&#20132;&#20114;&#20307;&#39564;&#25913;&#36827;&#12290;</p>

<h3>Q8:&#20320;&#26377;&#20160;&#20040;&#38382;&#39064;&#35201;&#38382;&#25105;&#30340;&#21527;&#65311;</h3>

<p>&#24681;&#65292;&#25105;&#26377;&#19968;&#20010;&#38382;&#39064;&#25110;&#32773;&#35828;&#26159;&#35831;&#27714;&#21543;&#12290;&#19981;&#31649;&#38754;&#35797;&#30340;&#32467;&#26524;&#22914;&#20309;&#65292;&#24403;&#28982;&#33021;&#22815;&#36890;&#36807;&#26159;&#25105;&#26368;&#24076;&#26395;&#30340;&#12290;&#25105;&#37117;&#24076;&#26395;&#33021;&#22815;&#30693;&#36947;&#24744;&#23545;&#25105;&#30340;&#34920;&#29616;&#30340;&#35780;&#20215;&#21644;&#25105;&#30340;&#19981;&#36275;&#20043;&#22788;&#65292;&#35753;&#25105;&#22312;&#33021;&#22815;&#23545;&#33258;&#24049;&#26377;&#26356;&#22909;&#30340;&#35748;&#35782;&#65292;&#21644;&#25552;&#39640;&#12290;&#40635;&#28902;&#24744;&#33021;&#22815;&#21457;&#19968;&#23553;&#37038;&#20214;&#32473;&#25105;&#12290;&#35874;&#35874;&#65281;</p>

<h3>Q9:&#20320;&#36935;&#21040;&#26368;&#25387;&#25240;&#30340;&#20107;&#24773;&#65311;</h3>

<p>&#25105;&#19981;&#30693;&#36947;&#36825;&#31639;&#19981;&#31639;&#25387;&#25240;&#65292;&#20294;&#26159;&#36825;&#20214;&#20107;&#30830;&#23454;&#23545;&#25105;&#36896;&#25104;&#20102;&#24456;&#22823;&#30340;&#24433;&#21709;&#65292;&#25105;&#20063;&#20174;&#20013;&#23398;&#21040;&#20102;&#24456;&#22810;&#30340;&#19996;&#35199;&#12290;<br>
&#22312;&#22823;&#19968;&#22823;&#20108;&#26399;&#38388;&#65292;&#22240;&#20026;&#25105;&#20010;&#24615;&#29233;&#29609;&#65292;&#20852;&#36259;&#24191;&#27867;&#65292;&#25105;&#21442;&#21152;&#20102;&#24456;&#22810;&#31038;&#22242;&#27963;&#21160;&#65292;&#21253;&#25324;&#20102;&#34903;&#33310;&#31038;&#65292;&#31726;&#29699;&#38431;&#65292;&#30005;&#23376;&#31454;&#25216;&#65292;&#20063;&#29609;&#20102;&#24456;&#22810;&#30340;&#28216;&#25103;&#65292;&#33457;&#36153;&#20102;&#24456;&#22810;&#26102;&#38388;&#65292;&#24182;&#27809;&#26377;&#32473;&#23398;&#20064;&#33150;&#20986;&#22826;&#22810;&#30340;&#26102;&#38388;&#65292;&#22240;&#27492;&#25105;&#22823;&#19968;&#22823;&#20108;&#22312;&#29677;&#37324;&#30340;&#25490;&#21517;&#19968;&#30452;&#37117;&#22312;&#20013;&#28216;&#12290;&#23548;&#33268;&#25105;&#22833;&#21435;&#20102;&#24456;&#22810;&#30340;&#26426;&#20250;&#12290;<br>
&#22823;&#20108;&#32467;&#26463;&#65292;&#25105;&#35748;&#30495;&#22320;&#24605;&#32771;&#21453;&#30465;&#20102;&#33258;&#24049;&#65292;&#24182;&#21046;&#23450;&#20102;&#19968;&#20221;&#35814;&#32454;&#21608;&#23494;&#30340;&#21517;&#20026;&#8220;&#19968;&#21322;&#22823;&#23398;&#8221;&#30340;&#35745;&#21010;&#65292;&#35745;&#21010;&#21253;&#25324;&#20102;&#25552;&#39640;&#25104;&#32489;&#65292;&#26377;&#35745;&#21010;&#22320;&#33258;&#23398;&#25216;&#26415;&#12290;<br>
&#36825;&#20010;&#35745;&#21010;&#19968;&#30452;&#25191;&#34892;&#21040;&#29616;&#22312;&#65292;&#24182;&#19988;&#20063;&#33719;&#24471;&#20102;&#25105;&#26399;&#26395;&#30340;&#32467;&#26524;&#12290;<br>
&#27604;&#22914;&#25105;&#22312;&#19978;&#23398;&#26399;&#30340;&#29677;&#37324;&#25490;&#21517;&#20013;&#65292;&#20197;&#32477;&#23545;&#20248;&#21183;&#25490;&#21517;&#31532;&#19968;&#65292;&#24182;&#19988;&#25353;&#35745;&#21010;&#19968;&#27493;&#19968;&#27493;&#23436;&#25104;&#35768;&#22810;&#33258;&#23398;&#20219;&#21153;&#12290;&#21253;&#25324;linux&#31995;&#32479;&#30340;&#23398;&#20064;&#65292;python&#65292;ruby&#30340;&#33258;
&#23398;&#65292;web&#24320;&#21457;&#35821;&#35328;&#33258;&#23398;&#65292;&#20197;&#21450;&#26368;&#36817;&#27491;&#22312;&#23398;&#20064;&#24403;&#20013;&#30340;jquery&#65292;webgl&#65292;canvas&#24320;&#21457;&#12290;&#29616;&#22312;&#27491;&#22312;&#23454;&#29616;&#30340;&#39033;&#30446;&#26159;&#20999;&#27700;&#26524;&#30340;&#32593;&#39029;&#29256;&#12290;&#30446;&#21069;&#24050;&#32463;&#23436;&#25104;&#30340;&#26159;
imagePreloaded&#65292;&#22270;&#29255;&#30340;&#39044;&#21152;&#36733;&#65292;&#19979;&#19968;&#27493;&#23558;&#35201;&#23454;&#29616;&#30340;&#26159;webgl&#23454;&#29616;&#30340;3d&#25928;&#26524;&#65292;&#21644;audio&#23454;&#29616;&#30340;&#22768;&#38899;&#25928;&#26524;&#12290;<br>
&#25105;&#24635;&#32467;&#20102;&#20174;&#37027;&#27425;&#25387;&#25240;&#20013;&#23398;&#21040;&#26368;&#37325;&#35201;&#30340;&#28857;&#35199;&#26159;&#65306;&#25105;&#35201;&#26102;&#21051;&#20445;&#25345;&#19968;&#39063;&#23398;&#20064;&#30340;&#24515;&#65292;&#27704;&#19981;&#25918;&#24323;&#65292;&#25165;&#33021;&#25235;&#20303;&#27599;&#19968;&#27425;&#26426;&#20250;&#12290;</p>

<h2>Part2 &#31616;&#21382;&#20934;&#22791;</h2>

<h3>Why python or ruby?</h3>

<p>1,python&#33021;&#29992;&#26356;&#23569;&#30340;&#20195;&#30721;&#23436;&#25104;&#20219;&#21153;&#12290;<br>
2,python&#26159;&#19968;&#31181;&#28165;&#26224;&#30340;&#35821;&#35328;&#12290;<br>
3,python&#33021;&#22815;&#24110;&#21161;&#25105;&#22312;linux&#24213;&#19979;&#36827;&#34892;shell&#24320;&#21457;&#12290;<br>
4,&#29992;python&#32534;&#31243;&#26159;&#19968;&#20214;&#24456;&#24841;&#24555;&#30340;&#20107;&#24773;&#12290;</p>

<h3>Simple introduce to flask?</h3>

<p>1,flask&#26159;&#19968;&#20010;&#24494;&#22411;&#26694;&#26550;&#65292;&#26377;&#27169;&#26495;&#65292;&#26377;session&#65292;&#26377;cookie&#65292;&#36275;&#22815;&#20570;&#31616;&#21333;&#30340;web&#24212;&#29992;&#12290;<br>
2,flask&#25552;&#20379;app.route()&#26469;&#23450;&#20041;url&#65292;&#25552;&#20379;render<em>to</em>template&#24212;&#29992;&#27169;&#26495;&#30340;&#26041;&#27861;&#12290;<br>
3,&#26368;&#20027;&#35201;&#30340;&#26159;flask&#26159;&#19968;&#20010;&#36731;&#37327;&#32423;&#30340;&#26694;&#26550;&#65292;&#24456;&#36866;&#21512;&#36827;&#34892;&#19968;&#20123;&#31616;&#21333;web&#30340;&#24320;&#21457;&#12290;</p>
</div>


</body></html>